Repository: patrickridd/scriptbuilder-ios
Catalog: FeatureAuth/Sources/FeatureAuth/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, hi, ja, ko, zh_hans

# auth.a11y.closeSignUp
source: Close sign up
de: Registrierung schließen
es: Cerrar registro
fr: Fermer l’inscription
hi: साइन अप बंद करें
ja: サインアップを閉じる
ko: 회원가입 닫기
zh_hans: 关闭注册

# auth.a11y.continueFacebook
source: Continue with Facebook
de: Mit Facebook fortfahren
es: Continuar con Facebook
fr: Continuer avec Facebook
hi: Facebook के साथ जारी रखें
ja: Facebook で続ける
ko: Facebook으로 계속하기
zh_hans: 使用 Facebook 继续

# auth.a11y.signInApple
source: Sign in with Apple
de: Mit Apple anmelden
es: Iniciar sesión con Apple
fr: Se connecter avec Apple
hi: Apple से साइन इन करें
ja: Apple でサインイン
ko: Apple로 로그인
zh_hans: 通过 Apple 登录

# auth.a11y.signInGoogle
source: Sign in with Google
de: Mit Google anmelden
es: Iniciar sesión con Google
fr: Se connecter avec Google
hi: Google से साइन इन करें
ja: Google でサインイン
ko: Google로 로그인
zh_hans: 通过 Google 登录

# auth.a11y.signUpApple
source: Sign up with Apple
de: Mit Apple registrieren
es: Registrarse con Apple
fr: S’inscrire avec Apple
hi: Apple से साइन अप करें
ja: Apple で登録
ko: Apple로 회원가입
zh_hans: 通过 Apple 注册

# auth.a11y.signUpFacebook
source: Sign up with Facebook
de: Mit Facebook registrieren
es: Registrarse con Facebook
fr: S’inscrire avec Facebook
hi: Facebook से साइन अप करें
ja: Facebook で登録
ko: Facebook으로 회원가입
zh_hans: 通过 Facebook 注册

# auth.a11y.signUpGoogle
source: Sign up with Google
de: Mit Google registrieren
es: Registrarse con Google
fr: S’inscrire avec Google
hi: Google से साइन अप करें
ja: Google で登録
ko: Google로 회원가입
zh_hans: 通过 Google 注册

# auth.status.signingIn
source: Signing you in…
de: Anmeldung läuft…
es: Iniciando sesión…
fr: Connexion en cours…
hi: साइन इन किया जा रहा है…
ja: サインインしています…
ko: 로그인 중…
zh_hans: 正在登录…

# auth.status.signingUp
source: Creating your account…
de: Konto wird erstellt…
es: Creando tu cuenta…
fr: Création de votre compte…
hi: आपका खाता बनाया जा रहा है…
ja: アカウントを作成しています…
ko: 계정을 만드는 중…
zh_hans: 正在创建你的账户…

# auth.alert.title
source: Heads up
de: Hinweis
es: Atención
fr: Attention
hi: ध्यान दें
ja: お知らせ
ko: 알림
zh_hans: 提示

# auth.button.createAccount
source: Create Account
de: Konto erstellen
es: Crear cuenta
fr: Créer un compte
hi: खाता बनाएँ
ja: アカウントを作成
ko: 계정 만들기
zh_hans: 创建账户

# auth.button.login
source: Log In
de: Anmelden
es: Iniciar sesión
fr: Se connecter
hi: लॉग इन करें
ja: ログイン
ko: 로그인
zh_hans: 登录

# auth.config.default.appName
source: Your App Name
de: Dein App-Name
es: Nombre de tu app
fr: Nom de votre app
hi: आपके ऐप का नाम
ja: アプリ名
ko: 앱 이름
zh_hans: 你的应用名称

# auth.config.default.loginFooterPrompt
source: New to [your app name]?
de: Neu bei [dein App-Name]?
es: ¿Nuevo en [tu app]?
fr: Nouveau sur [nom de votre app] ?
hi: [आपके ऐप का नाम] पर नए हैं?
ja: [アプリ名] は初めてですか？
ko: [앱 이름]이 처음이신가요?
zh_hans: 第一次使用[你的应用名称]？

# auth.config.default.loginSubtitle
source: Your personal app subtitle here
de: Hier steht der Untertitel deiner App
es: El subtítulo de tu app aquí
fr: Le sous-titre de votre app ici
hi: यहाँ आपके ऐप का उपशीर्षक
ja: ここにアプリのサブタイトル
ko: 여기에 앱 부제목을 입력하세요
zh_hans: 在此填写你的应用副标题

# auth.config.default.signUpFooterPrompt
source: Already have an account?
de: Hast du bereits ein Konto?
es: ¿Ya tienes una cuenta?
fr: Vous avez déjà un compte ?
hi: पहले से खाता है?
ja: すでにアカウントをお持ちですか？
ko: 이미 계정이 있으신가요?
zh_hans: 已经有账户了？

# auth.config.default.signUpSubtitle
source: Create your account to start
de: Erstelle dein Konto, um zu starten
es: Crea tu cuenta para empezar
fr: Créez votre compte pour commencer
hi: शुरू करने के लिए अपना खाता बनाएँ
ja: アカウントを作成して始めましょう
ko: 시작하려면 계정을 만드세요
zh_hans: 创建账户即可开始

# auth.divider.continueWith
source: or continue with
de: oder fortfahren mit
es: o continúa con
fr: ou continuer avec
hi: या इसके साथ जारी रखें
ja: または次で続ける
ko: 또는 다음으로 계속하기
zh_hans: 或使用以下方式继续

# auth.divider.signUpWith
source: or sign up with
de: oder registrieren mit
es: o regístrate con
fr: ou s’inscrire avec
hi: या इसके साथ साइन अप करें
ja: または次で登録
ko: 또는 다음으로 회원가입
zh_hans: 或使用以下方式注册

# auth.error.login.invalid
source: Enter a valid email and a password of at least 6 characters.
de: Gib eine gültige E-Mail und ein Passwort mit mindestens 6 Zeichen ein.
es: Introduce un correo válido y una contraseña de al menos 6 caracteres.
fr: Saisissez une adresse e-mail valide et un mot de passe d’au moins 6 caractères.
hi: एक मान्य ईमेल और कम से कम 6 अक्षरों का पासवर्ड दर्ज करें।
ja: 有効なメールアドレスと6文字以上のパスワードを入力してください。
ko: 유효한 이메일과 6자 이상의 비밀번호를 입력하세요.
zh_hans: 请输入有效的电子邮件和至少 6 个字符的密码。

# auth.error.reset.needEmail
source: Enter your email above, then tap “Forgot password?” again.
de: Gib oben deine E-Mail ein und tippe erneut auf „Passwort vergessen?“.
es: Introduce tu correo arriba y vuelve a tocar «¿Olvidaste tu contraseña?».
fr: Saisissez votre e-mail ci-dessus, puis touchez à nouveau « Mot de passe oublié ? ».
hi: ऊपर अपना ईमेल दर्ज करें, फिर “पासवर्ड भूल गए?” पर दोबारा टैप करें।
ja: 上にメールアドレスを入力してから、もう一度「パスワードをお忘れですか？」をタップしてください。
ko: 위에 이메일을 입력한 다음 “비밀번호를 잊으셨나요?”를 다시 탭하세요.
zh_hans: 请在上方输入你的电子邮件，然后再次点击“忘记密码？”。

# auth.error.signUp.invalid
source: Please fill in every field. Passwords need at least 6 characters.
de: Bitte fülle alle Felder aus. Passwörter benötigen mindestens 6 Zeichen.
es: Completa todos los campos. Las contraseñas necesitan al menos 6 caracteres.
fr: Veuillez remplir tous les champs. Les mots de passe doivent comporter au moins 6 caractères.
hi: कृपया हर फ़ील्ड भरें। पासवर्ड में कम से कम 6 अक्षर होने चाहिए।
ja: すべての項目を入力してください。パスワードは6文字以上必要です。
ko: 모든 항목을 입력하세요. 비밀번호는 6자 이상이어야 합니다.
zh_hans: 请填写所有字段。密码至少需要 6 个字符。

# auth.field.email.placeholder
source: you@example.com
de: du@beispiel.com
es: tu@ejemplo.com
fr: vous@exemple.com
hi: aap@udaharan.com

# auth.field.firstName.placeholder
source: Jane
de: Anna
es: Ana
fr: Marie
hi: प्रिया
ja: 花子
ko: 지민
zh_hans: 小明

# auth.field.firstName.title
source: First name
de: Vorname
es: Nombre
fr: Prénom
hi: पहला नाम
ja: 名
ko: 이름
zh_hans: 名字

# auth.field.lastName.placeholder
source: Doe
de: Müller
es: García
fr: Dupont
hi: शर्मा
ja: 山田
ko: 김
zh_hans: 王

# auth.field.lastName.title
source: Last name
de: Nachname
es: Apellido
fr: Nom
hi: अंतिम नाम
ja: 姓
ko: 성
zh_hans: 姓氏

# auth.field.password.placeholder
source: Your password
de: Dein Passwort
es: Tu contraseña
fr: Votre mot de passe
hi: आपका पासवर्ड
ja: パスワード
ko: 비밀번호
zh_hans: 你的密码

# auth.field.password.placeholder.min
source: At least 6 characters
de: Mindestens 6 Zeichen
es: Al menos 6 caracteres
fr: Au moins 6 caractères
hi: कम से कम 6 अक्षर
ja: 6文字以上
ko: 6자 이상
zh_hans: 至少 6 个字符

# auth.field.password.title
source: Password
de: Passwort
es: Contraseña
fr: Mot de passe
hi: पासवर्ड
ja: パスワード
ko: 비밀번호
zh_hans: 密码

# auth.link.forgotPassword
source: Forgot password?
de: Passwort vergessen?
es: ¿Olvidaste tu contraseña?
fr: Mot de passe oublié ?
hi: पासवर्ड भूल गए?
ja: パスワードをお忘れですか？
ko: 비밀번호를 잊으셨나요?
zh_hans: 忘记密码？

# auth.link.logIn
source: Log in
de: Anmelden
es: Inicia sesión
fr: Se connecter
hi: लॉग इन करें
ja: ログイン
ko: 로그인
zh_hans: 登录

# auth.link.signUp
source: Sign up
de: Registrieren
es: Regístrate
fr: S’inscrire
hi: साइन अप करें
ja: 登録
ko: 회원가입
zh_hans: 注册

# auth.reset.sent
source: We've sent a password reset link to %@.
de: Wir haben einen Link zum Zurücksetzen des Passworts an %@ gesendet.
es: Hemos enviado un enlace de restablecimiento a %@.
fr: Nous avons envoyé un lien de réinitialisation du mot de passe à %@.
hi: हमने %@ पर पासवर्ड रीसेट लिंक भेज दिया है।
ja: %@ にパスワード再設定リンクを送信しました。
ko: %@(으)로 비밀번호 재설정 링크를 보냈습니다.
zh_hans: 我们已向 %@ 发送了密码重置链接。

# auth.alert.ok
source: OK
es: Aceptar
hi: ठीक है
ko: 확인
zh_hans: 好

# auth.field.email.title
source: Email
es: Correo electrónico
hi: ईमेल
ja: メール
ko: 이메일
zh_hans: 电子邮件
